/* 
  Localizable.strings
  Tiliard
 
  Created by Marek Toth on 7/5/11.
  Copyright 2011 2 Key Players. All rights reserved.
*/

/* --- Alerts --- */

"AlertButtonOk"="OK";
"AlertButtonYes"="Yes";
"AlertButtonNo"="No";
"AlertButtonRate"="Rate";
"AlertButtonLater"="Later";
"AlertButtonLeaderboards"="Leaderboards";
"AlertButtonAchievements"="Achievements";
"AlertButtonProgress"="Progress";
"AlertButtonHints"="Hints";
"AlertButtonBack"="Back";
"AlertButtonReset"="Reset";
"AlertButtonCancel"="Cancel";

"AlertReset"="Reset";
"AlertTableEditor"="Table Editor";
"AlertTableEditorMessage"="Want to build your own tables?\nGive Tiliard a good rating and you'll get a chance to do so in the next update :)";
"AlertLanguageChange"="Info";
"AlertLanguageChangeMessage"="Changes will take effect after exiting the Options menu.";
"AlertTableRecord"="Table Record";
"AlertTableRecordMessage"="Send e-mail?";
"AlertMusic"="Music";
"AlertSound"="Sound";
"AlertTileSet"="Info";
"AlertTileSetMessage"="Additional tile sets will be available once new tile halls are unlocked.";
"AlertCloud"="Warning";
"AlertCloudMessage"="This will also reset your progress on iCloud.";

/* --- Gameplay --- */

"TableNumberAndDescription"="Table %d-%d\n%@";
"TableDescription"="%@\n(%@)";
"CurrentScoreEquation"="Current score = shots x moves\n%@";
"CurrentSolution"="Current solution\n%@";
"CreatorEquation"="Best score (set by %@) = shots x moves\n%@";
"BestRankAndScore"="Your best rank / score = shots x moves\n%@ / %d = %d x %d";
"BestSolution"="Your best solution\n%@";
"BestNoRankAndScore"="Your best rank / score\n- / -";
"BestNoSolution"="Your best solution\n-";

"Rank_1"="PLAYER";
"Rank_2"="PRO";
"Rank_3"="STAR";
"Rank_Final"="Tilehall Junkie";

"TweetRank_1"="PLAYER";
"TweetRank_2"="PRO";
"TweetRank_3"="STAR";
"Tweet"="I just cleared table %d-%d in #Tiliard as a %@. My solution is '%@'. bit.ly/Tiliard";

"Subject"="New table record";
"Body"="Hi 2 Key Players.\n\nI just beat the score on table %d-%d with solution '%@' and score %@.\nI'd like to have my name '%@' in the next update.\n\nThanks.";

"MaximumShotsReached"="Maximum number of shots reached!\nTap to undo the last shot.";
"DeadlockDetected"="Deadlock detected!\nTap to undo the last shot.";

"Congratulations"="Congratulations!\nYour final score is %d / %d.";
"ThanksForPlaying"="Thanks for playing Tiliard. We hope you've enjoyed it.\nNew tables are coming soon...";

"TellAFriend"="Check out this unique puzzle game for iOS by @2keyplayers. It's called #Tiliard. Give it a shot! http://bit.ly/Tiliard";

/* --- Tile halls --- */

/* Tile hall 1 */

"DescriptionTH01T01"="The Basics";
"IntroTH01T01_1"="Welcome to Tiliard! This is a HINT.\nTap to display the next HINT.";
"IntroTH01T01_2"="The goal of the game is to clear all OBJECT TILES\nby shooting them into the POCKETS.";
"IntroTH01T01_3"="Tap anywhere on the grid to place the white CUE TILE.";
"IntroTH01T01_4"="The CUE TILE is automatically placed\nnext to the nearest OBJECT TILE.";
"IntroTH01T01_5"="Tap the white CUE TILE to take the shot.";
"IntroTH01T01_6"="An OBJECT TILE will move as many squares\nas is indicated by the number on it.";
"IntroTH01T01_7"="To UNDO the last shot press\nthe button in the upper left corner. Try it now.";
"IntroTH01T01_8"="The game can be paused taking a TIME-OUT\nby pressing the button in the upper right corner.";
"IntroTH01T01_9"="To re-display HINTS go to the Main menu\nand select Options -> Reset -> Hints.";
"IntroTH01T01_10"="Enjoy!";
"DescriptionTH01T02"="Diagonals";
"IntroTH01T02_1"="You achieve a RANK for clearing a table\nbased on the number of SHOTS you take.";
"IntroTH01T02_2"="The fewer SHOTS you take,\nthe higher the RANK you achieve.";
"IntroTH01T02_3"="The ranking progress can be viewed by pressing\nthe button in the lower left corner. Try it now.";
"IntroTH01T02_4"="Become a Tiliard All-Star\nby achieving the Star RANK on all tables.";
"IntroTH01T02_5"="To get the 'Best Score' award you must match\nthe best score (shots x moves) for the table.";
"IntroTH01T02_6"="You can check the best score\nusing the Details button in the TIME-OUT menu.";
"DescriptionTH01T03"="Quick-shot";
"IntroTH01T03_1"="To perform a QUICK-SHOT\ndouble-tap the grid.";
"DescriptionTH01T04"="Aiming Assistant";
"IntroTH01T04_1"="To display the AIMING ASSISTANT for an OBJECT TILE\nplace the CUE TILE first.";
"IntroTH01T04_2"="Tap the OBJECT TILE next to the CUE TILE\nto see its trajectory.";
"IntroTH01T04_3"="Collisions between OBJECT TILES\nare not displayed by the AIMING ASSISTANT.";
"DescriptionTH01T05"="Cushions";
"IntroTH01T05_1"="Hitting a CUSHION will cause an OBJECT TILE to rebound.";
"IntroTH01T05_2"="Use CUSHION rebounds for better positioning.";
"DescriptionTH01T06"="Multi-shot";
"IntroTH01T06_1"="A well-placed shot can move multiple OBJECT TILES at once.";
"DescriptionTH01T07"="Pass and Shoot";
"DescriptionTH01T08"="Lower First";
"IntroTH01T08_1"="The OBJECT TILE with the lower number always moves first.";
"IntroTH01T08_2"="Tap the grid while the OBJECT TILES are moving\nto speed them up.";
"DescriptionTH01T09"="The Bait";
"IntroTH01T09_1"="To get the 'Table Record' award, you must beat\nthe current best score (shots x moves) for the table.";
"IntroTH01T09_2"="Don't forget to tweet and/or send us\nyour Table Record solution.";
"DescriptionTH01T10"="The Exam";

/* Tile hall 2 */

"DescriptionTH02T01"="Deja Vu";
"IntroTH02T01_1"="From this tile hall on, shot power is important.";
"IntroTH02T01_2"="An OBJECT TILE must stop moving exactly above a POCKET\nto drop into the POCKET.";
"DescriptionTH02T02"="Pick the Pockets";
"DescriptionTH02T03"="Flashbacks";
"DescriptionTH02T04"="Mastering the Pockets";
"IntroTH02T04_1"="Learn how POCKETS behave and use this to your advantage.";
"DescriptionTH02T05"="Stop-shot";
"IntroTH02T05_1"="If an OBJECT TILE hits another OBJECT TILE directly,\nit stops moving.";
"DescriptionTH02T06"="90-degree Rule";
"IntroTH02T06_1"="An indirect collision causes OBJECT TILES to deflect\nfollowing the 90-degree rule.";
"DescriptionTH02T07"="10 East";
"DescriptionTH02T08"="In and Out";
"DescriptionTH02T09"="Up and Round";
"DescriptionTH02T10"="T for Tiliard";

/* Tile hall 3 */

"DescriptionTH03T01"="Arrows";
"IntroTH03T01_1"="Arrows change the movement direction of OBJECT TILES.";
"DescriptionTH03T02"="Labyrinth";
"DescriptionTH03T03"="The One";
"DescriptionTH03T04"="Trick-shot";
"DescriptionTH03T05"="X-Tiles";
"IntroTH03T05_1"="X-tiles stop the movement of OBJECT TILES.";
"DescriptionTH03T06"="Triple X";
"DescriptionTH03T07"="Ghosts";
"IntroTH03T07_1"="Ghosts act as non-moving OBJECT TILES.";
"DescriptionTH03T08"="Ghost Keepers";
"DescriptionTH03T09"="The Wall";
"DescriptionTH03T10"="Follow the Signs";

/* Tile hall 4 */

"DescriptionTH04T01"="Not Again!";
"IntroTH04T01_1"="To apply SPIN place the CUE TILE first.";
"IntroTH04T01_2"="Tap and hold the CUE TILE\nthen swipe up or down and release.";
"IntroTH04T01_3"="Tap the CUE TILE again to take the shot.";
"DescriptionTH04T02"="Draw or Follow";
"IntroTH04T02_1"="Back SPIN (draw) causes an OBJECT TILE\nto move half the distance.";
"IntroTH04T02_2"="Top SPIN (follow) causes an OBJECT TILE\nto move twice the distance.";
"DescriptionTH04T03"="Quick-spin";
"IntroTH04T03_1"="To perform a QUICK-SHOT with SPIN\ndouble-tap and hold, swipe up or down and release.";
"DescriptionTH04T04"="Multi-spin";
"DescriptionTH04T05"="The Heart";
"DescriptionTH04T06"="Minefield";
"DescriptionTH04T07"="8V";
"DescriptionTH04T08"="Tilehall Junkie";
"DescriptionTH04T09"="The Tile";
"DescriptionTH04T10"="Finish Him!";

/* Tile hall 5 */

"DescriptionTH05T01"="Colors";
"IntroTH05T01_1"="In this tile hall, colors play an important role.";
"DescriptionTH05T02"="Single Tracks";
"DescriptionTH05T03"="Traffic Lights";
"DescriptionTH05T04"="Ridiculous";
"DescriptionTH05T05"="Home, Sweet Home";
"DescriptionTH05T06"="Addition and Subtraction";
"IntroTH05T06_1"="Plus/Minus fields change the movement length of OBJECT TILES.";
"DescriptionTH05T07"="Inversion";
"DescriptionTH05T08"="Wot Goes Fast";
"DescriptionTH05T09"="Pyramids";
"DescriptionTH05T10"="Finish Line";
